app/Http/Controllers/RepliesController.php

    public function store(ReplyRequest $request, Reply $reply)
    {
        $reply->content = $request->content;
        $reply->topic_id = $request->topic_id;
        $reply->user_id  = Auth::id();
        $reply->save();
---
insert into `replies` (`content`, `topic_id`, `user_id`, `updated_at`, `created_at`) values ('<p>zzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz</p>', '57', 13, '2019-12-26 22:54:13', '2019-12-26 22:54:13')

    public function destroy(Reply $reply)
    {
        $this->authorize('destroy',$reply);
        $reply->delete();
        return redirect()->to($reply->topic->link())->with('success','评论删除成功');
---
delete from `replies` where `id` = 332
select * from `topics` where `topics`.`id` = 61 limit 1