app/Http/Controllers/TopicsController.php

select * from `categories`
---
	public function create(Topic $topic, Category $category)
	{
        $categories = Category::all();

select * from `categories`
---
	public function edit(Topic $topic,Category $category)
	{
        $this->authorize('update', $topic);
        $categories = Category::all();

update `topics` set `title` = '人人人人人人人人人人', `updated_at` = '2019-12-11 04:11:12' where `id` = 101
---
	public function update(TopicRequest $request, Topic $topic)
	{
		$this->authorize('update', $topic);
		$topic->update($request->all());

delete from `topics` where `id` = 102
---
	public function destroy(Topic $topic)
	{
		$this->authorize('destroy', $topic);
		$topic->delete();