app/Http/Controllers/UsersController.php

update `users` set `updated_at` = '2020-01-01 19:05:05', `avatar` = 'http://larabbs.test/uploads/Images/avatars/202001/01/1_1577876705_YLuf4FxMyo.jpeg' where `id` = 1
---
    public function update(User $user, UserRequest $request, ImageUploadHandler $uploader)
    {
        $this->authorize('update',$user);

        $data = $request->all();
        if($request->avatar)
        {
            $result = $uploader->save($request->avatar,'avatars',$user->id,416);
            if($result)
            {
                $data['avatar'] = $result['path'];
            }
        }
        $user->update($data);