app/Models/Link.php

select * from `links`
---
    public function getLinkCache()
    {
        return Cache::remember($this->cache_key,$this->cache_expire_in_minutes,function(){
                return $this->all();