app/Models/Topic.php

    public function updateReplyCount()
    {
        $this->reply_count = $this->replies->count();
        $this->save();
---
update `topics` set `reply_count` = 9, `updated_at` = '2019-12-26 22:54:13' where `id` = 57