app/Models/User.php

    public  function notify($instance)
    {
        if(Auth::id() == $this->id)
        {
            return;
        }
        if(method_exists($instance, 'toDatabase'))
        {
            $this->increment('notification_count');
---
update `users` set `notification_count` = `notification_count` + 1, `updated_at` = '2019-12-26 22:54:14' where `id` = 1